{"title":"Blog of Web Technologies Expert Matthias Max - Transparenz im Shopfloor - Wie REMONDIS mit CaseOS® Produktionsdaten auswertet","date":"July 08, 2021","url":"/blog/transparenz-im-shopfloor-wie-remondis-mit-case-os-produktionsdaten-auswertet","author":"Matthias Max","twitter":"bitflowertweets","description":"Jedes Unternehmen muss heute - zumindest in Teilen - zum Softwareunternehmen werden. Die Herausforderungen und die Komplexität der digitalen Produktenticklung stellen aber eine ganze eigene Disziplin dar. Neben Ihrer Branchen-Kernkompotenz muss sich ihr Unternehmen quasi \"nebenher\" auch noch um Cloud, APIs, Schnittstellen, UX/UI, Javascript, Frameworks und DevOps kümmern. Ganz schön anstrengend!","img":"/assets/img/blog/posts/remondis-case-os.jpg","tags":["OPC UA","IoT","IIoT","KPI","Dashboard","Industrie 4.0","Produktionsdaten","Sensor","Siemens S7","PLC","Subscription"],"relatedProjects":0,"srcPath":"./src/blog/wie-remondis-mit-case-os-produktionsdaten-monitored.md","hypertext":["div",null,["p",null,["img",{"src":"/assets/img/blog/posts/remondis-case-os.jpg","alt":"Remondis + CaseOS"}]],"\n",["p",null,["b",null,"Der Bedarf nach Transparenz im Shopfloor nimmt stetig zu. Die aktuellen Produktionszahlen tragen bei der Führung des Unternehmens maßgeblich zu sinnvollen wirtschaftlichen Entscheidungen bei. Der weltweit größte Dienstleister für Recycling, Service und Wasser REMONDIS hat am Standort Heilbronn nun eine Lösung mit CaseOS® entwickelt, die zuverlässig, in Echtzeit und ohne manuellen Aufwand die Ballenproduktion überwacht."]],"\n",["h2",{"id":"der-pain-point"},"Der Pain Point"],"\n",["p",null,"\"Wir wollen die Zahlen nicht mehr in Excel erfassen und auswerten. Das ist zu viel manueller Aufwand, schlecht zugänglich und es droht die Gefahr, dass die Zahlen auch mal nicht stimmen. So kann man keine vernünftigen Auswertungen erstellen und daraus Maßnahmen ableiten.\" berichtete Tobias Kutz, Niederlassungsleiter des Standorts Heilbronn bei der REMONDIS Süd GmbH bei unserem Erstgespräch."],"\n",["h2",{"id":"die-vorgefundenen-gegebenheiten"},"Die vorgefundenen Gegebenheiten"],"\n",["p",null,"Das Gute vorweg: Die Voraussetzungen für eine digitale Lösung waren mit der vorhandenen Siemens S7-gesteuerten Ballenpressenanlage geschaffen. Da die Anlage bereits mit Konnektivtät in Form einer OPC UA Schnittstelle ausgestattet war, konnten Sensorwerte direkt gelesen werden. Mit dem CaseOS® OPC UA Adapter war somit eine reibungslose Datenanbindung möglich."],"\n",["p",null,"Anhand der bestehenden Excelauswertungen konnten die Business-Anforderungen für das neue digitale Dashboard abgeleitet werden. Zu den Anforderungen zählten die Zeitreihenanalyse mit der Möglichkeit zeitlich zu filtern. Außerdem eine Jahresplannungssicht mit Fokus auf Monatsergbenisse, die es erlaubt, bestimmte Szenarien parametriesiert durchzuspielen und die Auswirkung auf Kennzahlen/KPIs zu simulieren."],"\n",["h2",{"id":"setup"},"Setup"],"\n",["p",null,"Durch den Einsatz der Anwendungsplattform CaseOS® "],"\n",["p",null,"[Architekturbild]"],"\n",["h2",{"id":"eingesetzte-module"},"Eingesetzte Module"],"\n",["h3",{"id":"opc-ua-konnektor"},"OPC UA Konnektor"],"\n",["p",null,"Deckt Ignore REgeln, Datenanreicherung, Veredlung, Transformationstages"],"\n",["h3",{"id":"atomicui-view-engine"},"AtomicUI View Engine"],"\n",["h3",{"id":"benutzer--und-rechteverwaltung"},"Benutzer- und Rechteverwaltung"],"\n",["h3",{"id":"timeseris-business-rules"},"Timeseris Business Rules"],"\n",["p",null,"Aggregationen"],"\n",["h3",{"id":"custom-business-rules"},"Custom Business Rules"],"\n",["p",null,"Jahressicht mit "],"\n",["h3",{"id":"dynamische-rest-services"},"Dynamische REST-Services"],"\n",["h3",{"id":"websocket-echtzeit-verbindung"},"WebSocket Echtzeit-Verbindung"],"\n",["h3",{"id":"openci"},"OpenCI"],"\n",["h3",{"id":"on-premise-hosting"},"On-Premise Hosting"],"\n",["h3",{"id":"daten-export-und--druck"},"Daten-Export und -Druck"],"\n",["h2",{"id":"testimonial"},"Testimonial"],"\n",["p",null,"\"Total klasse! So wollte ich das haben.\" - Tobias Kutz, REMONDIS Süd GmbH, Niederlassungsleiter Heilbronn"],"\n",["p",null,"Die Nachfrage nach flexiblen -Dashboards ist groß. Unternehmen aller Größen monitoren mittlerweile ihre Produktion oder sind dabei dies zu tun. OPC UA und Geschäftslogik  CaseOS® REMONDIS hat ein Produktionszahlen\nImmer häufiger sollen im IIoT-Kontext technische Sensordaten mit Business\nDas Monitoren der hauseigenen Produktion im IIoT-Zeitist REMONDIS ."]]}